[% page.title = 'Wie benutze ich den NTP Pool?' %]

<div class="block">
 <h3><a name="use"></a>Wie benutze ich pool.ntp.org?</h3>

 <p>
  Zur Synchronisation der Uhrzeit Ihres Computers nutzen Sie die folgende,
  einfache Konfiguration f&uuml;r den <a href="http://www.ntp.org">ntpd</a>
  Dienst, unabh&auml;ngig davon, welches Betriebssystem Sie einsetzen:
 </p>

<pre class="code">
driftfile /var/lib/ntp/ntp.drift

server 0.pool.ntp.org
server 1.pool.ntp.org
server 2.pool.ntp.org
server 3.pool.ntp.org</pre>
 <p>
  Die Ziffern 0, 1, 2 und 3 zusammen mit <i>pool.ntp.org</i> zeigen auf
  einen Satz von Servern, der sich st&uuml;ndlich &auml;ndert. Bevor der
  <i>ntpd</i>-Dienst gestartet werden kann, muss die Systemzeit grob (im
  Bereich weniger Minuten) eingestellt werden. Das kann manuell mit
  <tt>date</tt> oder &uuml;ber den NTP Pool mit <tt>ntpdate
   pool.ntp.org</tt> geschehen. Anschlie&szlig;end sollte der
  <i>ntpd</i>-Dienst problemlos starten. Nach einigen Minuten kann der
  Status des Dienstes abgerufen werden. Die Ausgabe des Kommandos <tt>ntpq -pn</tt>
  sollte in etwa wie folgt aussehen:
 </p>
<pre class="code ntpq">
avbidder:~$ ntpq -p
remote           refid      st t when poll reach   delay   offset  jitter
==============================================================================
+81.6.42.224     193.5.216.14     2 u   68 1024  377  158.995   51.220  50.287
*217.162.232.173 130.149.17.8     2 u  191 1024  176   79.245    3.589  27.454
-129.132.57.95   131.188.3.222    3 u  766 1024  377   22.302   -2.928   0.508
</pre> 
 <p>
  Die IP-Adressen werden andere sein, da zuf&auml;llige Zeitserver aus
  dem NTP Pool eingesetzt werden. Ausschlaggebend ist, dass einer der
  Zeitserver mit einem Stern (<tt>*</tt>) markiert ist. Erst dann wird
  die Systemzeit mit dem Internet synchronisiert und Sie m&uuml;ssen sich
  ab jetzt nicht mehr darum sorgen.
 </p>
 <p>
  Da <tt>pool.ntp.org</tt> zuf&auml;llige Zeitserver aus der ganzen
  Welt zuweist, kann es zu einer ungenauen Synchronisation kommen. F&uuml;r
  etwas bessere Ergebnisse empfielt es sich, eine der
  <a href="/zone/@">kontinentalen Zonen</a> (z. B.
  <a href="/zone/europe">europe</a>,
  <a href="/zone/north-america">north-america</a>,
  <a href="/zone/oceania">oceania</a>
  oder <a href="/zone/asia">asia</a>.pool.ntp.org),
  oder gar noch besser eine L&auml;nderzone wie zum Beispiel
  <i>ch.pool.ntp.org</i> in der Schweiz oder <i>de.pool.ntp.org</i> in
  Deutschland zu benutzen. Auch in diesen Zonen k&ouml;nnen wieder die Ziffern
  0, 1, 2 oder 3 vorangestellt werden (z. B. 0.de.pool.ntp.org).
  Bitte beachten Sie, dass nicht alle L&auml;nderzonen existieren, oder
  darin nur wenige Zeitserver enthalten sein k&ouml;nnen. Sollten Sie einen
  Zeitserver kennen, der sich in Ihrer N&auml;he befindet, wird die
  Zeitsynchronisation damit vermutlich besser sein.
 </p>
 <p>
  Sollten Sie eine neuere Version von <b>Windows</b> einsetzen,
  k&ouml;nnen Sie den NTP-Client nutzen, der in das System integriert
  ist. F&uuml;hren Sie dazu folgendes Kommando als Administrator aus:
 </p>
<pre class="code">
w32tm /config /syncfromflags:manual /manualpeerlist:"0.pool.ntp.org 1.pool.ntp.org 2.pool.ntp.org 3.pool.ntp.org"
</pre>
Dieses Kommando funktioniert auf Versionen ab Windows 2003. Wenn Sie eine ältere Windows-Version benutzen, können Sie folgendes Kommando probieren:
<pre class="code">
net time /setsntp:"0.pool.ntp.org 1.pool.ntp.org 2.pool.ntp.org 3.pool.ntp.org"
</pre>
 </p>
 <p>
  Das Gleiche kann als Administrator erreicht werden, wenn Sie mit der rechten
  Maustaste auf die Uhrzeit in der Systemleiste klicken und dann auf
  &quot;Einstellungen&quot;.
  Dort kann der Zeitserver bzw. die Zone unter &quot;Internetzeit&quot;
  eingetragen werden.
 </p>

 <p>
  Der <i>ntpd</i>-Dienst wurde von Meinberg auf Windows portiert: <a
  href="http://www.meinberg.de/german/sw/ntp.htm">ntpd f&uuml;r Windows</a>.
 </p>

 <p>
  Sollten Sie sich innerhalb einer Dom&auml;ne befinden, kann es sein, dass Sie
  Ihre Systemzeit nicht unabh&auml;ngig definieren k&ouml;nnen. Für weitere
  Informationen zur Einstellung von Zeitservern unter Windows siehe
  <a
  href="http://technet.microsoft.com/en-us/library/cc773013%28WS.10%29.aspx">&quot;How
  Windows Time Service Works&quot;</a>.
 </p>
</div>

<div class="block">
 <h3>Zus&auml;tzliche Anmerkungen</h3>
 <p><span class="hook">Wenn Sie &uuml;ber eine statische IP-Adresse und eine
   vern&uuml;nftige Bandbreite verf&uuml;gen</span> (die Bandbreite ist weniger
  relevant als eine stabile Anbindung), erw&auml;gen Sie bitte, Ihren Server in
  den NTP Pool mit aufnehmen zu lassen. Der zus&auml;tzlich entstehende Verkehr
  betr&auml;gt im Allgemeinen nicht mehr als ein paar hundert Byte pro
  Sekunde, jedoch helfen Sie dabei, dieses Projekt am Leben zu halten. Bitte <a
   href="/join.html">lesen Sie die Beitrittsseite</a> f&uuml;r weitere
  Informationen.
 </p>

 <p><span class="hook">Verf&uuml;gt Ihr Internetanbieter &uuml;ber einen
   Zeitserver</span> oder Sie kennen einen guten Zeitserver in Ihrer
  N&auml;he, sollten Sie diesen nutzen anstelle des NTP Pools. Die
  Zeitsynchronisation wird dadurch besser und es werden weniger
  Netzwerkressourcen genutzt. Selbstverst&auml;ndlich k&ouml;nnen
  Sie die Zeitserver des NTP Pools auch zus&auml;tzlich zu den Ihnen bekanten
  Servern hinzuf&uuml;gen.</p>

 <p><span class="hook">In seltenen F&auml;llen kann es passieren, dass Ihnen
   der gleiche Zeitserver zweimal zugewiesen wurde</span>. In einem solchen
  Fall hilft ein einfaches Neustarten des <i>ntpd</i>-Dienstes.
  Wenn Sie L&auml;nderzonen einsetzen, in denen nur wenige Zeitserver
  registriert sind, steigt jedoch die Wahrscheinlichkeit eines solchen Falles.
  Am besten setzen Sie dann auf kontinentale Zonen. In der <a
   href="/zone">Liste der Zonen</a> k&ouml;nnen Sie durch alle Zonen
  bl&auml;ttern, um zu sehen, wieviele Server sich in welcher Zone befinden.</p>

 <p><span class="hook">Seien Sie freundlich</span>. Viele Server werden von
  Freiwilligen betrieben und fast alle werden auch f&uuml;r private Zwecke
  eingesetzt. Also nutzen Sie bitte nicht mehr als vier Zeitserver
  in Ihrer Konfiguration und spielen Sie niemandem b&ouml;se Streiche mit
  <tt>burst</tt> oder <tt>minpoll</tt>. Das Einzige, was Sie damit erreichen
  k&ouml;nnen ist zusätzliche Beansprungung des Servers eines Freiwilligen.</p>

 <p><span class="hook">Vergewissern Sie sich, dass die
  <i>Zeitzonenkonfiguration</i> Ihres Computers korrekt ist</span>. <i>ntpd</i>
  selbst kennt keine Zeitzonen - es arbeitet intern mit UTC.</p>

 <p><span class="hook">Wenn Sie ein Netzwerk mit pool.ntp.org synchronisieren
   m&ouml;chten</span>, setzen Sie bitte einen Ihrer Server als Zeitserver
  ein, der dann als einziger den NTP Pool nutzt und synchronisieren Sie alle anderen
  Computer mit diesem. Das Aufsetzten eines eigenen Zeitservers ist nicht
  weiter schwierig, erfordert allerdings ein paar Seiten der Anleitung zu lesen.
  Bei Schwierigkeiten wird Ihnen sicherlich die <a href="news:comp.protocols.time.ntp"
 >comp.protocols.time.ntp Newsgroup</a> weiterhelfen.</p>

 <p class="thanks">Zum Schluss m&ouml;chte ich allen danken, die Ihre
  Server dem NTP Pool zur Verf&uuml;gung stellen.</p>
</div>
