<div class="block">

<h3>Konfigurationsempfehlungen f&uuml;r die Teilnahme am NTP Pool</h3>

<p>
 Der <a href="http://support.ntp.org/bin/view/Support/WebHome">Support</a> auf
 <a href="http://support.ntp.org/">support.ntp.org</a> verf&uuml;gt &uuml;ber
 eine Menge n&uuml;tzlicher Informationen bez&uuml;glich des NTP-Protokolls.
</p>

<p>
 Wenn Sie den NTP Pool lediglich <i>benutzen</i> m&ouml;chten, lesen Sie bitte
 die <a href="/use.html">Wie benutze ich den NTP Pool?</a> Seite.
</p>

<p>
 Als eine weitere Anlaufstelle dient die <a
  href="http://groups.google.com/group/comp.protocols.time.ntp">comp.protocols.time.ntp</a>
  Newsgruppe. Dort wird Ihnen beim Einsatz der NTP Sofware selbst geholfen.
</p>

<p>
 Im Folgenden werden einige relevante Informationen f&uuml;r den Betrieb Ihres
 Zeitservers im NTP Pool beschrieben.
</p>

<h4 id="management-queries">Management queries</h4>

<p>Make the default configuration be to not allow "management queries". For ntpd this will be adding the "noquery" option to the default "restrict" lines, for example:</p>

[% INCLUDE "join/configuration/restrict-default.html" %]

<p>To allow commands like "ntpq -c pe" to work from localhost you can add:</p>

[% INCLUDE "join/configuration/restrict-localhost.html" %]

<h4>Setup f&uuml;r etwa 5 Server</h4>

<p>
 Um einwandfrei funktionieren zu k&ouml;nnen, ben&ouml;tigt der
 <i>ntpd</i>-Dienst mindestens drei eingetragene Zeitserver (&quot;Mit einer Uhr
 wei&szlig; man wie sp&auml;t es ist. Mit zweien ist man sich nicht mehr
 sicher&quot;).
</p>

<p>
 Server im NTP Pool m&uuml;ssen mindestens vier und d&uuml;rfen maximal sieben
 Zeitserver zur Synchronisation einsetzen.
</p>

<h4>Benutzen Sie nicht *.pool.ntp.org als Zeitserver</h4>

<p>
 Um die Qualit&auml;t der Zeitsynchronisation zu halten, sollten Sie
 ironischerweise keine der <tt>*.pool.ntp.org</tt> Adressen in Ihrer
 Konfiguration benutzen.
</p>

<p>
 F&uuml;r einen robusten und gesunden Pool ist es das Beste, Sie w&auml;hlen den
 f&uuml;r Sie am besten funktionierenden Zeitserver in Ihrer Umgebung. Das
 NTP.org Wiki hat daf&uuml;r eine <a
 href="http://support.ntp.org/bin/view/Servers/WebHome">Liste &ouml;ffentlicher
 Server</a>.
</p>

<h4>Benutzen Sie den Standard NTPd-Dienst</h4>

<p>
 Softwarealternativen sind prinzipiell etwas Gutes, jedoch hat sich
 herausgestellt, das der Gro&szlig;teil der aufgetretenen Problem durch den
 Einsatz des Standard <tt>ntpd</tt>-Dienst behoben werden konnte.
</p>

<p>
 Benutzen k&ouml;nnen Sie den NTP Pool mit jeder Software, die das NTP Protokoll
 integriert hat. Zum Betrieb eines Servers empfehlen wir Ihnen jedoch den
 offiziellen <a
 href="http://support.ntp.org/bin/view/Main/SoftwareDownloads">ntpd</a>.
</p>
<p>
 Sie k&ouml;nnen den Pool mit jedem Programm, das NTP spricht, <i>benutzen</i>,
 wollen Sie dem Pool aber beitreten, empfehlen wir den Einsatz des
 <a href="http://support.ntp.org/bin/view/Main/SoftwareDownloads">ntpd</a>.
</p>

<h4>Nutzen Sie nicht die lokale Uhrzeit</h4>

<p>
 Server im NTP Pool sollten auf den Einsatz der lokalen Uhrzeit verzichten.
</p>

</div>
