Repository: abh/ntppool
Catalog: i18n/*.po
Languages: ar, bg, bn, ca, cs, da, de, el, es, eu, fa, fi, fr, ga, he, hi, hr, it, jp, kk, ko, nb, nl, no, pl, pt, ro, ru, si, sv, th, tr, uk, zh_cn, zh_tw

source: go up
ar: اذهب للأعلى
bg: нагоре
bn: উপরে যান
ca: puja amunt
cs: nahoru
da: gå op
de: zum Seitenanfang
el: πήγαινε στην κορυφή
es: Ir arriba
eu: Aldera gain
fa: برو بالا
fi: ylös
fr: remonter
ga: téigh suas
he: לך למעלה
hi: ऊपर जायें
hr: na vrh
it: vai su
jp: 先頭に戻る
kk: жоғары өту
ko: 위로 가기
nb: gå opp
nl: omhoog
no: gå opp
pl: do góry
pt: subir
ro: mergi sus
ru: наверх
si: උඩට යන්න
sv: upp ett steg
th: ขึ้นไป
tr: üste çık
uk: вверх
zh_cn: 向上
zh_tw: 回到上方

source: Africa
ar: أفريقيا
bg: Африка
bn: আফ্রিকা
ca: Àfrica
cs: Afrika
da: Afrika
de: Afrika
el: Αφρική
es: África
eu: Afrika
fa: آفریقا
fi: Afrikka
fr: Afrique
ga: Afraic
he: אפריקה
hi: अफ्रीका
hr: Afrika
jp: アフリカ
kk: Африка
ko: 아프리카
nb: Afrika
nl: Afrika
no: Afrika
pl: Afryka
pt: África
ru: Африка
si: අප්‍රිකාව
sv: Afrika
th: แอฟริกา
tr: Afrika
uk: Африка
zh_cn: 非洲
zh_tw: 非洲

source: North America
ar: أمريكا الشمالية
bg: Северна Америка
bn: উত্তর আমেরিকা
ca: Amèrica del Nord
cs: Severní Amerika
da: Nordamerika
de: Nordamerika
el: Βόρεια Αμερική
es: Norteamérica
eu: Iparramerika
fa: آمریکای شمالی
fi: Pohjois-Amerikka
fr: Amérique du Nord
ga: Meiriceá Thuaidh
he: צפון אמריקה
hi: उत्तरी अमेरिका
hr: Sjeverna Amerika
it: Nord America
jp: 北米
kk: Солтүстік Америка
ko: 북아메리카
nb: Nord-Amerika
nl: Noord Amerika
no: Nord-Amerika
pl: Ameryka Północna
pt: América do Norte
ro: America de Nord
ru: Северная Америка
si: උතුරු ඇමරිකාව
sv: Nordamerika
th: อเมริกาเหนือ
tr: Kuzey Amerika
uk: Північна Америка
zh_cn: 北美洲
zh_tw: 北美

source: South America
ar: أمريكا الجنوبية
bg: Южна Америка
bn: দক্ষিন আমেরিকা
ca: Amèrica del Sud
cs: Jižní Amerika
da: Sydamerika
de: Südamerika
el: Νότια Αμερική
es: Sudamérica
eu: Hegoamerika
fa: آمریکای جنوبی
fi: Etelä-Amerikka
fr: Amérique du Sud
ga: Meiriceá Theas
he: דרום אמריקה
hi: दक्षिण अमेरिका
hr: Južna Amerika
it: Sud America
jp: 南米
kk: Оңтүстік Америка
ko: 남아메리카
nb: Sør-Amerika
nl: Zuid Amerika
no: Sør-Amerika
pl: Ameryka Południowa
pt: América do Sul
ro: America de Sud
ru: Южная Америка
si: දකුණු ඇමරිකාව
sv: Sydamerika
th: อเมริกาใต้
tr: Güney Amerika
uk: Південна Америка
zh_cn: 南美洲
zh_tw: 南美

source: Europe
ar: أوروبا
bg: Европа
bn: ইউরোপ
ca: Europa
cs: Evropa
da: Europa
de: Europa
el: Ευρώπη
es: Europa
eu: Europa
fa: اروپا
fi: Eurooppa
ga: Eoraip
he: אירופה
hi: यूरोप
hr: Europa
kk: Еуропа
ko: 유럽
nb: Europa
no: Europa
pl: Europa
si: යුරෝපය
sv: Europa
th: ยุโรป
tr: Avrupa
uk: Європа
zh_tw: 歐洲

source: Oceania
ar: أوقيانوسيا
bg: Океания
bn: ওশেনিয়া
da: Oceanien
de: Ozeanien
el: Ωκεανία
es: Oceanía
eu: Ozeania
fa: اقیانوسیه
fi: Oseania
fr: Océanie
ga: Aigéine
he: אוקיאניה
hi: ओसीनिया
hr: Oceanija
kk: Океания
ko: 오세아니아
nb: Oseania
no: Oseania
si: ඕසියානාව
sv: Oceanien
th: โอเชียเนีย
tr: Okyanusya
uk: Океанія
zh_tw: 大洋洲

source: Global
ar: عالميا
bg: Глобално
bn: আন্তর্জাতিক
cs: Globální
de: Weltweit
el: Παγκόσμια
eu: Globala
fa: جهانی
fi: Maailmanlaajuinen
fr: Mondial
ga: Gomhanda
he: גלובלי
hi: ग्लोबल
hr: Globalno
it: Globale
jp: 全世界
kk: Жаһандық
ko: 전지역
nb: Globalt
nl: Wereldwijd
pl: Świat
ru: Итого
si: ලෝකව්‍යාප්ත
sv: Globalt
th: ทั่วโลก
tr: Genel
uk: Глобально
zh_cn: 全球
zh_tw: 全球

source: All Pool Servers
ar: جميع الخوادم الزمنية (Pool Servers)
bg: Всички сървъри
bn: সকল পুল সার্ভারসমূহ
ca: Tots els servidors del Pool
cs: Všechny Pool Servery
da: Alle pool-servere
de: Alle Pool-Server
el: Όλοι οι διακομιστές
es: Todos los servidores
eu: Pool zerbitzari guztiak
fa: استخر تمامی سرور ها
fi: Kaikki palvelimet
fr: Tous les Réservoirs de Serveurs
ga: Gach Freastalaí Bailiúchán
he: כל שרתי ה-Pool
hi: सभी पूल सर्वर
hr: Svi Pool Serveri
it: Tutti i server del pool
jp: 全てのプールサーバ
kk: Барлық пул серверлері
ko: 모든 풀 서버
nb: Alle puljetjenere
nl: Alle pool-servers
no: Alle Puljetenarar
pl: Wszystkie serwery puli
pt: Todos os servidores
ro: Toate Serverele
ru: Всего серверов в пуле
si: සියලු සර්වර
sv: Alla servrar i poolen
th: เซิร์ฟเวอร์พูลทั้งหมด
tr: Tüm Havuz Sunucuları
uk: Всі сервери пулу
zh_cn: 全部Pool服务器
zh_tw: 所有可用伺服器

source: Translations
ar: الترجمة
bg: Преводи
bn: অনুবাদসমূহ
ca: Traduccions
cs: Překlady
da: Oversættelser
de: Übersetzungen
el: Μεταφράσεις
es: Traducciones
eu: Itzulpenak
fa: ترجمه ها
fi: Käännökset
fr: Traductions
ga: Aistriúcháin
he: תרגומים
hi: अनुवाद
hr: Prijevodi
it: Traduzioni
jp: 翻訳
kk: Аудармалар
ko: 번역
nb: Oversettelser
nl: Vertalingen
no: Omsetjingar
pt: Traduções
ro: Tranduceri
si: අනුවාදය
sv: Översättningar
th: การแปลภาษา
tr: Çeviriler
uk: Іншими мовами
zh_cn: 翻译者
zh_tw: 語言

source: Introduction
ar: المقدمة
bg: Въведение
bn: সূচনা
da: Introduktion
de: Anleitung
el: Εισαγωγή
es: Introducción
eu: Sarrera
fa: معرفی
fi: Johdanto
ga: Réamhrá
he: הקדמה
hi: परिचय
hr: Uvod
it: Introduzione
kk: Кіріспе
ko: 소개
nb: Introduksjon
no: Instroduksjon
pl: Wstęp
si: හැඳින්වීම
sv: Introduktion
th: บทนำ
tr: Önsöz
uk: Ознайомлення
zh_tw: 介紹

source: Active Servers
ar: المخدمات المفعلة
bg: Активни сървъри
bn: সক্রিয় সার্ভারসমূহ
da: Aktive Servere
de: Aktive Server
el: Ενεργοί διακομιστές
es: Servidores Activos
eu: Zerbitzari aktiboak
fa: سرور های فعال
fi: Aktiiviset palvelimet
fr: Serveurs Actifs
ga: Freastalaithe Gníomhacha
he: שרתים פעילים
hi: सक्रिय सर्वर
hr: Aktivni Serveri
it: Server attivi
kk: Белсенді серверлер
ko: 활성 서버
nb: Aktive tjenere
no: AAktive tenarar
pl: Aktywne serwery
si: ක්‍රියාකාරී සර්වර
sv: Aktiva Servrar
th: เซิร์ฟเวอร์ที่ใช้งานอยู่
tr: Aktif Sunucular
uk: Активні сервери
zh_tw: 現有伺服器

source: Links
ar: الروابط
bg: Връзки
bn: লিংক সমূহ
el: Σύνδεσμοι
es: Enlaces
eu: Estekak
fa: پیوند ها
fi: Linkit
fr: Liens
ga: Naisc
he: קישורים
hi: लिंक्स
hr: Linkovi
it: Link
kk: Сілтемелер
ko: 링크
nb: Lenker
no: Lenkjer
pl: Odnośniki
si: ඇමිණුම්
sv: Länkar
th: ลิงก์ที่เกี่ยวข้อง
tr: Bağlantılar
uk: Посилання
zh_tw: 連結

source: Terms of service
ar: شروط الخدمة
bg: Условия за ползване
bn: পরিষেবার শর্তাবলী
da: Betingelser for service
de: Nutzungsbedinungen
el: Όροι χρήσης
es: Términos de servicio
eu: Zerbitzu baldintzak
fa: شرایط استفاده از خدمات
fi: Käyttöehdot
fr: Conditions d'utilisation
ga: Tearmaí Seirbhís
he: תנאי השירות
hi: सेवा की शर्तें
hr: Uvjeti usluge
it: Termini di servizio
kk: Қызмет шарттары
ko: 서비스 이용약관
nb: Bruksvilkår
no: Bruksvilkår
pl: Warunki
si: සේවාවේ කොන්දේසි
sv: Användarvillkor
th: ข้อกำหนดการให้บริการ
tr: Hizmet koşulları
uk: Умови обслуговування
zh_tw: 服務條款

source: Subscribe in a reader
ar: اشترك كقارئ
bg: Абониране в четец
bn: রিডারে সাবস্ক্রাইব করুন
da: Tilmeld i en læser
de: Einen Leser abonnieren
el: Κάντε εγγραφή
es: Suscribirse en un lector
eu: Irakurgailuan harpidetu
fa: عضویت در خبرنامه
fi: Tilaa lukijaan
fr: S'abonner dans un lecteur
ga: Liostáil i léitheoir
he: הרשם עם תוכנת קריאה
hi: पाठक की सदस्यता लें
hr: Pretplati se u čitaču
it: Iscriviti ai feed
kk: Оқырмандарға жазылу
ko: 피드 리더 앱으로 구독
nb: Abonner i en RSS-leser
no: Abonnér med ein RSS-lesar
pl: Subskrybuj w czytniku
si: කියවීමට අනුසන් වෙන්න
sv: Prenumerera i läsare
th: สมัครรับข่าวผ่านฟีด
tr: Bir okuyucudan abone olun
uk: Підписатися через читач
zh_tw: 訂閱RSS

source: Older news
ar: الأخبار القديمة
bg: По-стари новини
bn: পুরাতন খবর
da: Gamle nyheder
de: Ältere Neuigkeiten
el: Παλαιότερα άρθρα
es: Noticias anteriores
eu: Berri zaharragoak
fa: خبر های قدیمی
fi: Vanhemmat uutiset
fr: Anciennes nouvelles
ga: Nuacht níos sine
he: חדשות קודמות
hi: पुराने समाचार
hr: Starije vijesti
it: Notizie precedenti
kk: Ескі жаңалықтар
ko: 지난 소식
nb: Eldre nyheter
no: Gamle nyhende
pl: Starsze wiadomości
si: පරණ පුවත්
sv: Äldre nyheter
th: ข่าวเก่า
tr: Daha önceki haberler
uk: Старіші новини
zh_tw: 舊新聞

source: NTP Pool mailing lists
ca: Llista de correu del NTP Pool
cs: E-mailové konference NTP Pool
da: NTP Pool-postlister
de: NTP Pool Mailinglisten
es: Listas de correo de equipos de NTP
fi: NTP Poolin postituslistat
he: רשימות תפוצה של ה-NTP Pool
hi: एनटीपी पूल मेलिंग सूची
jp: NTPプール メーリングリスト
nb: NTP-pulje-E-postlister
nl: NTP Pool e-maillijsten
no: E-postlister for prosjektet
pl: Listy mailingowe puli NTP
pt: Listas de discussão do NTP Pool
ro: Lista de discuţii a comunităţii NTP
ru: Списки рассылки пула NTP
si: NTP සංසදයේ ඊමේල් ලැයිස්තුව
tr: NTP Havuz posta listeleri
zh_cn: NTP Pool 邮件列表

source: subscribe
ar: اشترك
ca: apuntar-s'hi
cs: přihlásit odběr
da: abonnér
de: abonnieren
es: suscribirse
fa: عضویت
fi: tilaa
he: הרשם
hi: सदस्यता लें
it: iscriviti
jp: 登録
nb: abonner
nl: abonneer
no: abonner
pl: zapisz się
pt: inscrever-se
ro: inscrie-te
ru: подписаться
si: අනුසන්
tr: abonelik
zh_cn: 订阅

source: archive
ar: الأرشيف
bg: архив
bn: আর্কাইভ
ca: arxiu
cs: archiv
da: arkiv
de: Archiv
el: αρχείο
es: archivo
eu: artxiboa
fa: بایگانی
fi: arkisto
ga: cartlan
he: ארכיון
hi: संग्रह
hr: arhiva
it: archivio
jp: アーカイブ
kk: мұрағат
ko: 지난 소식
nb: arkiv
nl: archief
no: arkiv
pl: archiwum
pt: arquivo
ro: arhivă
ru: архив
si: තෝම්බුව
sv: arkiv
th: คลังข้อมูล
tr: arşiv
uk: архів
zh_cn: 归档
zh_tw: 存檔

source: NTP Pool Forum
ar: منتدى الخوادم الزمنية (Pool Servers)
bg: Форум на NTP Pool
bn: এনটিপি পুল ফোরাম
es: Foro del Pool NTP
eu: NTP Pool Foroa
fa: انجمن NTP Pool
fr: Forum NTP Pool
ga: Fóram Bailiúchán NTP
it: Forum di NTP Pool
kk: NTP Pool форумы
ko: NTP 풀 게시판
nb: NTP-puljeforum
th: ฟอรัม NTP Pool
uk: Форум NTP Pool
zh_tw: NTP Pool論壇

source: News site
ar: موقع جديد
bg: Новинарски сайт
bn: খবরের সাইট
de: Neuigkeiten
el: Νέα άρθρα
es: Sitio de noticias
eu: Berri gunea
fa: سایت اخبار
fr: Site d'actualités
ga: Láithreán nuachta
hr: Stranica vijesti
it: Notizie
kk: Жаңалықтар сайты
ko: 소식 사이트
nb: Nyhetsside
sv: Nyhetsida
th: เว็บไซต์ข่าว
uk: Сайт новин
zh_tw: 新聞網站

source: Development
ar: تطوير
bg: Разработка
bn: উন্নয়ন
de: Entwicklung
el: Ανάπτυξη-Προγραμματισμός
es: Desarrollo
eu: Garapena
fa: توسعه
fr: Développement
ga: Forbairt
hr: Razvoj
it: Sviluppo
kk: Дамыту
ko: 개발
nb: Utvikling
sv: Utveckling
th: การพัฒนาโครงการ
uk: Розробка
zh_tw: 開發

source: forum_description
ar: Questions (and answers) about the NTP Pool, suggestions for improvements and topics related to time keeping and operating NTP servers.
bg: Най-доброто място за обсъждане на NTP Pool проекта
bn: ফোরাম_বর্ণনা
de: Fragen (und Antworten) über den NTP Pool, Vorschläge zur Verbesserung und Themen über das behalten von Zeiten und betreiben eines eigenen NTP Servers
el: Ερωτήσεις (και απαντήσεις) σχετικά με την δεξαμενή NTP, προτάσεις για βελτιώσεις και θέματα που σχετίζονται με τη χρονομέτρηση και τη λειτουργία διακομιστών NTP.
es: Preguntas (y respuestas) acerca del Pool NTP, sugerencias para mejoras y temas relacionados con el mantenimiento de la hora y operación de servidores NTP.
eu: NTP Pool proiektuari buruzko galderak (eta erantzunak), hobekuntza proposamenak eta denbora mantenimendua eta NTP zerbitzarien kudeaketarekin zerikusia duten gaiak.
fa: سوال و جواب درباره سایت، پیشنهادات در جهت ارتقاء و موضوعات مربوط به زمان و مدیریت سرور های ان تی پی
fr: Questions (et réponses) sur NTP Pool, suggestions d'améliorations et sujets liés au chronométrage et au fonctionnement des serveurs NTP.
ga: Ceisteanna (agus freagraí) faoin Bailiúchán NTP, moltaí le haghaidh feabhsuithe agus ábhair a bhaineann le ham a choinneáil agus freastalaithe NTP a oibriú.
hr: Pitanja (i odgovori) o NTP Pool-u, prijedlozi za poboljšanja i teme vezane uz održavanje vremena i upravljanje NTP serverima.
it: Domande e risposte su NTP Pool, consigli per usarlo al meglio e discussioni sulla sincronizzazione oraria dei sistemi e sull'uso e manutenzione dei server NTP.
kk: NTP Pool жобасы туралы сұрақтар (және жауаптар), жетілдіру ұсыныстары және уақыт басқару және NTP сервер басқаруға қатысты тақырыптар.
ko: NTP 풀에 대한 문답, 개선 제안, 그리고 NTP 서버 운영에 대한 논의.
nb: Spørsmål (og svar) om NTP-puljen, forslag til forbedringer, og temaer relatert til tidtaking og å drifte NTP-tjenere.
sv: Frågor (och svar) om NTP Pool, förslag på förbättringar och ämnen relaterade till tidsmätning och drift av NTP-servrar.
th: คำถาม (และคำตอบ) เกี่ยวกับ NTP Pool คำแนะนำในการปรับปรุง และหัวข้อที่เกี่ยวข้องกับการรักษาเวลาและการดำเนินการเซิร์ฟเวอร์ NTP
uk: Питання (і відповіді) про пул NTP, пропозиції щодо покращень і теми, пов'язані з веденням часу та експлуатацією NTP серверів.
zh_tw: 有關NTP Pool的問題（和解答）、改進建議以及與計時和操作NTP伺服器相關的話題。

source: news_description
ar: Announcements and news are posted on the news site or the forum.
bg: Новини и анонси за NTP Pool проекта
bn: খবর_বর্ণনা
de: Neuigkeiten und Ankündigungen werden auf der Nachrichtenseite des Forums gepostet
el: Οι ανακοινώσεις και τα νέα δημοσιεύονται στον ιστότοπο ειδήσεων ή στο forum.
es: Los anuncios y noticias se publican en el sitio de noticias o en el foro.
eu: NTP Pool proiektuaren berriak eta iragarpenak
fa: اطلاعیه ها و اخبار در سایت اخبار و یا سایت انجمن پست میشوند
fr: Les annonces et nouvelles sont publiées sur le site d'actualités ou dans le forum.
ga: Cuirtear fógraí agus nuacht ar fáil ar an suíomh nuachta nó ar an bhfóram.
hr: Najave i vijesti se objavljuju na stranici vijesti ili na forumu.
it: Annunci generali e notizie vengono pubblicati in questa sezione oppure sul forum.
kk: NTP Pool жобасының жаңалықтары мен хабарландырулары
ko: 공지사항 및 소식이 소식 사이트 혹은 게시판에 게시됩니다.
nb: Annonseringer og nyheter blir lagt ut på nyhetssiden eller i forumet.
sv: Meddelanden och nyheter publiceras på nyhetssidan eller på forumet.
th: ประกาศและข่าวสารจะถูกโพสต์บนเว็บไซต์ข่าวหรือฟอรัม
uk: Оголошення та новини публікуються на сайті новин або на форумі.
zh_tw: 公告和新聞發布在新聞網站或論壇上。

source: Announcement list
ca: Llista d'avisos
cs: Konference pro oznámení
da: Nyhedsliste
de: Verteiler "Ankündigungen"
es: Lista de avisos
fi: Ilmoituslista
he: תפוצת הכרזות
hi: घोषणा सूची
jp: お知らせリスト
nb: Liste for kunngjøringer
nl: Aankondigingenlijst
no: Kunngjeringsliste
pl: Lista ogłoszeń
pt: Lista de anúncio
ro: Lista de anunţuri
ru: Новостная рассылка
si: නිවේදන ලැයිස්තුව
tr: Duyuru listesi
zh_cn: 公告列表

source: Discussion list
ar: قائمة نقاش
bg: Дискусионен списък
bn: আলোচনা তালিকা
ca: Llista de discussions
cs: Diskusní konference
da: Diskussionsliste
de: Verteiler "Diskussionen"
el: Λίστα συζητήσεων
es: Lista de debates
eu: Eztabaida zerrenda
fa: لیست مباحثه ها
fi: Keskustelulista
fr: Liste de discussion
ga: Liosta plé
he: תפוצת דיונים
hi: चर्चा सूची
hr: Lista za rasprave
it: Lista discussioni
jp: ディスカッションリスト
kk: Талқылау тізімі
ko: 논의 리스트
nb: Liste for diskusjoner
nl: Discussielijst
no: Diskusjonsliste
pl: Lista dyskusyjna
pt: Lista de discussão
ro: Lista de discuţii
ru: Рассылка для обсуждений
si: සංවාද ලැයිස්තුව
sv: Diskussionslista
th: กลุ่มสนทนา
tr: Tartışma listesi
uk: Список обговорень
zh_cn: 讨论组列表
zh_tw: 討論群組

source: Development list
ca: Llista de desenvolupament
cs: Vývojářská konference
da: Udviklingsliste
de: Verteiler "Entwicklung"
es: Lista de desarrollo
fi: Kehityslista
he: תפוצת פיתוח
hi: विकास कार्य सूची
jp: 開発リスト
nb: Liste for utvikling
nl: Ontwikkelaarslijst
no: Utviklingsliste
pl: Lista deweloperów
pt: Lista de desenvolvimento
ro: Lista de progres
ru: Рассылка для разработчиков
si: ප්‍රවර්ධනය ලැයිස්තුව
tr: Geliştirme listesi
zh_cn: 开发人员列表

source: announcement_list_description
ca: Llista d'avisos de notícies del NTP Pool amb una freqüència molt, molt baixa. Tots els administradors de servidors hi haurien d'estar apuntats.
cs: Velmi velmi nízký počet oznámení o NTP Pool novinkách. Všichni operátoři serverů by měli být přihlášeni do konference pro oznámení.
da: Nyhedsliste med meget lav trafik. Alle serveroperatører burde være tilmeldt nyhedslisten.
de: Wenig frequentierter Verteiler für die wichtigsten Ankündigungen des NTP-Pool-Projekts. Alle Serveradministratoren sollten diese Liste abonniert haben.
es: Avisos de tráfico muy muy lento de noticias del grupo NTP. Todas las operaciones del servidor se deben suscribir a la lista de avisos.
fi: NTP Poolin ilmoituslista, jolla on hyvin vähän liikennettä. Kaikkien poolin palvelinten ylläpitäjien tulisi liittyä tähän.
he: הכרזות חדשות בנוגע ל NTP Pool הנשלחות לעתים נדירות מאוד. כל מפעילי השרתים צריכים להיות רשומים לתפוצת ההכרזות.
hi: एनटीपी पूल समाचार की बहुत कम ट्रैफिक की घोषणाएं. सभी सर्वर ऑपरेटरों को घोषणा सूची में सब्सक्राइब करना आवश्यक है
jp: 非常に低トラフィックなNTPプールニュースのお知らせ。すべてのサーバ管理者は、お知らせリストに登録してください。
nb: Veldig lite traffik med kunngjøringer av NTP Pulje-nyheter. Alle tjeneroperatører bør abonnere på kunngjøringslisten.
nl: Zeer zeer laag frequente aankondigingen van nieuws over de NTP Pool. Alle serverbeheerders zouden op de aankondigingenlijst geabonneerd moeten zijn.
no: Kortfatta og presise kunngjeringar med nyhende om NTP Pool-prosjektet. Alle tenar-administratorar bør abonnere på denne lista.
pl: Lista ogłoszeń puli NTP o bardzo małym ruchu. Wszyscy operatorzy serwerów powinni się zapisać na listę ogłoszeń.
pt: Muito, mas muito pouco tráfego de anúncios de novidades do NTP Pool. Todos os administradores de servidores deveriam se inscrever na lista de anúncio.
ro: Trafic foarte, foarte scăzut a listei de anunţuri a comunităţii NTP. Toţi administratorii de servere ar trebui să se înscrie in aceasta lista de anunţuri.
ru: Рассылка новостей пула NTP. Ее трафик очень невелик. Всем администраторам серверов пула рекомендуется подписаться на эту рассылку.
si: NTP සංසදයේ ඉතාමත් පහළ ප්‍රමුඛතාව සහිත නිවේදන ලැයිස්තුව. සියලුම සංසදයේ සර්වර් ක්රියාකරවන්නම් නිවේදන ලැයිස්තුවට ඇතුලත් වී සිටීය යුතුය.
tr: NTP Havuz bildirilerinin duyuru trafiği çok çok düşük. Tüm sunucu operatörleri duyuru listesine abone olmalıdır.
zh_cn: 非常少的 NTP Pool 新闻. 所有管理员都应该订阅公告列表.

source: discussion_list_description
ar: Server operators (and users) who wish to be more involved in the project can subscribe to the discussion list.<br/> Of course, general discussions about ntp should take place on the %1 Usenet newsgroup (also on <a href="%2">Google Groups</a>).
ca: Administradors de servidors (i usuaris) que volen estar més involucrat es poden apuntar a la llista de discussions. Naturalment, discussions sobre el servei ntp en general s'haurien de fer en el grup de Usenet %1 (també disponible a través de <a href="%2">Google Groups</a>).
cs: Operátoři serverů (a uživatelé), kteří chtějí být více zapojeni do projektu se mohou přihlásit do této konference.<br/> Samozřejmě, obecná diskuse o ntp by měla probíhat v Usenet skupině %1 (také na <a href="%2">Google Groups</a>).
da: Serveroperatører (og brugere) som ønsker at være mere engageret i projektet kan abonnere på diskussionslisten.<br/>Generel diskussion omkring ntp bør selvfølgelig tage sted i %1 Usenet-nyhedsgruppen (også på <a href="%2">Google Groups</a>).
de: Serveradministratoren (und Benutzer), die sich am NTP-Pool-Projekt beteiligen wollen, sind in diesem Verteiler herzlich Willkommen.<br/>Über allgemeine Themen rund um NTP sollte jedoch in der Usenet Newsgruppe %1 diskutiert werden (siehe auch <a href="%2">Google Groups</a>).
es: Los operadores de servidor (y los usuarios) que deseen involucrase más en el proyecto pueden suscribirse a la lista de debates.<br/>Por supuesto, los debates generales sobre ntp deben estar en el grupo de noticias %1 de Usenet (incluso en <a href="%2">Google Groups</a>).
fa: اپراتور های سرور و یا کاربرانی که قصد دارند در پروژه ها مداخله بیشتری داشته باشند، میتواند در بخش مباحثه عضو شوند.<br/> البته مباحثه های عمومی درباره ان تی پی میبایست در 1 درصد شبکه کاربران مربوط به گروه خبری انجام شود (همچنین در <a href="%2">Google Groups</a>)
fi: Palvelinylläpitäjien (ja käyttäjien) jotka haluavat osallistua projektiin enemmän kannattaa liittyä keskustelulistalle.<br/>Yleisen ntp-aiheisen keskustelun tulisi tapahtua %1 Usenet-uutisryhmässä (myös <a href="%2">Google Groupsissa</a>).
he: מפעילי שרתים (ומשתמשים) אשר מעוניינים להיות מעורבים יותר בפרוייקט יכולים להרשם אל רשימת הדיונים.<br/> כמובן, שדיונים כלליים אודות ntp מקומם בקבוצת היוזנט %1 (וגם ב<a href="%2">קבוצות גוגל</a>).
hi: सर्वर ऑपरेटर (और उपयोगकर्ता), जो परियोजना में अधिक शामिल होना चाहते हैं, चर्चा सूची की सदस्यता ले सकते हैं.<br/> बेशक, एनटीपी के बारे में सामान्य चर्चा %1 यूज़नेट न्यूज ग्रुप पर होनी चाहिए (<a href="%2">Google ग्रुप्स</a>पर भी उपलब्ध
it: Operatori di server (e utenti) che desiderano essere coinvolti nel progetto possono iscriversi alla lista discussioni.<br/> Le discussioni generali su NTP dovrebbero aver luogo su Usenet %1 (anche via <a href="%2">Google Gruppi</a>).
jp: このプロジェクトにより深く関与したいサーバ管理者(とユーザ)はディスカッションリストに登録して下さい。<br/>当然ですが、ntpに関する一般的な議論は、Usenetニュースグループ%1で行って下さい。(<a href="%2">Google Groups</a>にもあります)。
nb: Tjeneroperatører (og brukere) som ønsker å være mer involverte i prosjektet kan abonere på diskusjonslisten.<br/> Generell diskusjon om ntp bør skje på Usenet-temagruppen (óg på <a href="%2">Google Grupper</a>).
nl: Serverbeheerders (en gebruikers) die meer betrokken willen zijn bij het project kunnen zich abonneren op de discussielijst.<br/>Algemene discussies over ntp zouden natuurlijke plaats moeten vinden in de Usenet-nieuwsgroep %1 (ook op <a href="%2">Google Groups</a>).
no: Tenaradministatorar (og gjerne brukarar) som ynskjer å involvere seg meir i prosjektet kan abonnere til denne diskusjonslista. <br/> Generelle diskusjonar om ntp bør takast på %1 Usenet nyhendegruppa (og på <a href="%2">Google Groups</a>).
pl: Operatorzy (i użytkownicy) serwerów, którzy chcieliby być bardziej zaangażowani w projekcie mogą się zapisać na listę dyskusujną.<br/> Oczywiście ogólne tematy dotyczące NTP powinny być poruszane na grupie dyskusyjnej Usenetu %1 (także na <a href="%2">Grupach Google</a>).
pt: Administradores (e usuários) de servidores que queiram se envolver mais no projeto podem ser inscrever na lista de discussão.<br/>É claro, discussões gerais sobre o ntp deveriam ocorrer no grupo de notícias Usenet %1 (também no <a href="%2">Grupo do Google</a>).
ro: Administratorii de servere ( şi utilizatori ) care doresc să se implice in acest proiect, se pot înscrie in lista de discuţii.<br/> Desigur, discuţiile generale ar trebui să aiba loc pe %1 Usenet newsgroup ( sau si pe <a href="%2">Google Groups</a>).
ru: Эта рассылка предназначена для администраторов серверов пула и просто пользователей, которые хотят более активно участвовать в проекте.<br/> Разумеется, обсуждение общих вопросов, относящихся к NTP, должно происходить в Usenet-конференции %1 (<a href="%2">доступна</a> через сервис Google Groups).
si: වැඩිදුර සාකච්චා කිරීමට කැමති සියලුම සර්වර් ක්රියාකරවන්නන් (සහ පරිශීලකයින්) ට සංවාද ලැයිස්තුව සඳහා අනුසන් විය හැක.<br/> ntp පිළිබඳව සාමාන්‍ය සංවාද සඳහා %1 ද. (එලෙසම <a href="%2">Google සංවාද මන්ඩපයද</a>).
tr: Sunucu operatörleri ve kullanıcılardan projede daha aktif olmak isteyen varsa tartışma listesine abone olabilir.<br/> NTP hakkında genel tartışmalar tabii ki %1 Usenet haber grubunda (aynı zamanda <a href="%2">Google Gruplarında</a>) olmalıdır.
zh_cn: 服务器管理员 (或者用户) 凡是参与项目的人员都建议订阅讨论组列表.<br/> 当然, 最佳讨论ntp项目的地方是在 %1 网络用户新闻组 (或者在 <a href="%2">Google Groups</a>).
