Repository: abh/ntppool
Catalog: i18n/*.po
Languages: ar, bg, bn, ca, cs, da, de, el, es, eu, fa, fi, fr, ga, he, hi, hr, it, jp, kk, ko, nb, nl, no, pl, pt, ro, ru, si, sv, th, tr, uk, zh_cn, zh_tw

source: development_list_description
ar: More technical (and ideally pragmatic) discussions about development of the <a href="%1">ntp pool code</a> and <a href="%2">geodns</a> happens in the <a href="%3">development forum</a>.
bg: Технически дискусии за разработката на NTP Pool проекта
bn: উন্নয়ন_তালিকা_বর্ণনা
ca: Discussions més tècniques (i pragmàtiques) sobre el desenvolupament en curs del <a href="%1">ntp pool code</a> i <a href="%2">pgeodns</a> es fan en la llista <i>timekeepers-dev</i>.
cs: Více technické (a ideálně vždy pragmatické) diskuse o současném vývoji <a href="%1">ntp pool kódu</a> a <a href="%2">pgeodns</a> probíhají v konferenci timekeepers-dev.
da: Mere tekniske (og ideelt set altid pragmatiske) diskussioner om den nuværende udvikling af <a href="%1">ntp pool-koden</a> og <a href="%2">pgeodns</a> sker på timekeepers-dev-listen.
de: Technische (und idealerweise immer pragmatische) Diskussionen über die aktuelle Entwicklung des <a href="%1">NTP-Pool Quellcodes</a> und <a href="%2">GeoDNS</a> werden über den <i>timekeepers-dev</i>-Verteiler geführt.
el: Περισσότερες τεχνικές (και ιδανικά ρεαλιστικές) συζητήσεις σχετικά με την ανάπτυξη του <a href="%1">ntp pool code</a> και του <a href="%2">GeoDNS</a> πραγματοποιούνται στο <a href="%3">forum ανάπτυξης</a
es: Los debates más técnicos (e idealmente pragmáticos) sobre el desarrollo del <a href="%1">código del pool ntp</a> y <a href="%2">GeoDNS</a> ocurren en el <a href="%3">foro de desarrollo</a>.
eu: NTP Pool proiektuaren garapenari buruzko eztabaida teknikoak
fa: بحث های فنی (و در حالت ایده آل عملی تر) درباره توسعه <a href="%1">کدهای استخر ان تی پی</a> و <a href="%2"> ژئو دی ان اس ها</a> در <a href="%3">انجمن توسعه</a> اتفاق می افتد
fi: Teknisemmät (ja toivottavasti myös käytännöllisemmät) <a href="%1">poolin koodiin</a> ja <a href="%2">pgeodns:n</a> kehittämiseen liittyvät keskustelut käydään timekeepers-dev-listalla.
fr: Les discussions plus techniques (et idéalement plus pragmatiques) sur le développement actuel du <a href="%1">code du réservoir ntp</a> et de <a href="%2">GeoDNS</a> ont lieu sur la liste timekeepers-dev.
ga: Tarlaíonn plé níos teicniúla (agus go hidéalach pragmatach) faoi fhorbairt an <a href="%1">chóid bailiúchán ntp</a> agus <a href="%2">GeoDNS</a> san <a href="%3">fhóram forbartha</a>.
he: דיונים יותר טכניים (ובאופן אידאלי תמיד פרגמטיים) אודות הפיתוח הנוכחי של <a href="%1">קוד ה-ntp pool</a> ושל <a href="%2">pgeodns</a> מתרחשים ברשימת התפוצה timekeepers-dev.
hi: <a href="%1">एनटीपी पूल कोड</a> और <a href="%2">GeoDNS</a> के वर्तमान विकास कार्य के बारे में अधिक तकनीकी (और आदर्श रूप में हमेशा व्यावहारिक) चर्चा timekeepers-dev सूची पर होती है
hr: Više tehničke (i idealno pragmatične) diskusije o razvoju <a href="%1">ntp pool koda</a> i <a href="%2">GeoDNS</a> odvijaju se u <a href="%3">razvojnom forumu</a>.
it: Discussioni tecniche (e possibilmente pragmatiche) riguardo lo sviluppo del <a href="%1">codice di ntp pool</a> e <a href="%2">pgeodns</a> si trovano sulla lista timekeepers-dev.
jp: 現在の<a href="%1">ntpプールコード</a>と<a href="%2">pgeodns</a>開発のためのより技術的な(そして理想を言えば実用的な)議論はtimekeepers-devリストで行われています。
kk: NTP Pool жобасының дамуы туралы техникалық талқылаулар
ko: <a href="%1">NTP 풀 코드</a>와 <a href="%2">GeoDNS</a>의 현재 개발에 대한 더 기술적인 토론은 <a href="%3">개발 게시판</a>에 있습니다.
nb: Mer tekniske (og ideelt sett løsningsorienterte) diskusjoner om aktuell utvikling innen <a href="%1">ntp pulje-koden</a> og <a href="%2">pgeodns</a> skjer på timekeepers-dev listen.
nl: Meer technische (en idealiter altijd praktische) discussies over de huidige ontwikkeling van de <a href="%1">broncode van ntp pool</a> en <a href="%2">pgeodns</a> vinden plaats op de lijst timekeepers-dev.
no: Meir tekniske (og helst sett løysingsorienterte) diskusjonar om aktuell utvikling innan<a href="%1">prosjektkoden</a> og <a href="%2">pgeodns</a> skjer på timekeepers-dev diskusjonslista.
pl: Bardziej techniczne (i najlepiej zawsze praktyczne) dyskusje o bieżącym rozwoju <a href="%1">kodu puli NTP</a> i <a href="%2">pgeodns</a> mają miejsce na liście timekeepers-dev.
pt: Discussões mais técnicas (e idealmente sempre programática) sobre o atual desenvolvimento do <a href="%1">código do ntp pool</a> e <a href="%2">pgeodns</a> ocorrem na lsita dos desenvolvedores mantenedores dos relógios.
ro: Discuţiile tehnice ( şi mai întotdeauna pragmatice ) despre progresul acestui proiect îl găsiţi pe <a href="%1">comunitatea NTP</a> si <a href="%2">pgeodns</a> au loc in lista timekeepers-dev
ru: Здесь обсуждаются технические вопросы, связанные с разработкой <a href="%1">исходного кода пула NTP</a> и <a href="%2">pgeodns</a>.
si: <a href="%1">ntp සංසදයේ කේත</a> සහ <a href="%2">pgeodns</a> පිලිබඳ වර්තමාන සැකසුම් සහ වැඩිදුර තාක්ෂණික (සහ සාමාන්‍ය උපයෝගික) සංවාද සිදුවන්නේ timekeepers-dev ලයිස්තුවේය.
sv: Mer tekniskt inriktade (och förhoppningsvis alltid pragmatiska) diskussioner kring den löpande utvecklingen av <a href="%1">koden för ntp pool</a> och <a href="%2">GeoDNS</a> sker på listan timekeepers-dev.
th: การสนทนาทางเทคนิค (และเน้นการใช้งานจริง) เกี่ยวกับการพัฒนา <a href="%1">โค้ด NTP Pool</a> และ <a href="%2">GeoDNS</a> จะอยู่ใน <a href="%3">ฟอรัมการพัฒนา</a>
tr: <a href="%1">NTP havuz kodu</a> ve <a href="%2">pgeodns</a> geliştirmeleri hakkındaki daha teknik (ve öyle de olmalı) tartışmalar timekeepers-dev listesinde olmalı.
uk: Більш технічні (і бажано прагматичні) обговорення розробки <a href="%1">коду пулу NTP</a> і <a href="%2">GeoDNS</a> відбуваються на <a href="%3">форумі розробників</a>.
zh_cn: 更多最新技术 (或始终务实的创意) 进展的讨论都可以在 <a href="%1">ntp pool code</a> 或者位于 <a href="%2">pgeodns</a> 查看最新项目变化的 timekeepers-dev 邮件列表.
zh_tw: 關於<a href="%1">ntp pool程式碼</a>和<a href="%2">GeoDNS</a>開發的更多技術性（並且理想情況下實用的）討論在<a href="%3">開發論壇</a>中進行。

source: Back to the front page
ar: الرجوع الى القائمة الرئيسية
bg: Обратно към началната страница
bn: প্রথম পাতায় ফিরে যান
ca: Torneu a la pàgina principal
cs: Návrat na hlavní stranu
da: Tilbage til forsiden
de: Zurück zur Startseite
el: Επιστροφή στην κεντρική σελίδα
es: Volver a la portada
eu: Hasierako orrira itzuli
fa: بازگشت به صفحه نخست
fi: Takaisin etusivulle
fr: Retour à la page d'accueil
ga: Ar ais go dtí an leathanach tosaigh
he: בחזרה לדף הראשי
hi: वापस मुख्य पृष्ठ पर जाएं
hr: Nazad na početnu stranicu
it: Torna alla pagina principale
jp: 最初のページに戻る
kk: Басты бетке оралу
ko: 첫 페이지로 돌아가기
nb: Tilbake til forsiden
nl: Terug naar de voorpagina
no: Attende til framsida
pl: Wróć do strony głównej
pt: Voltar para a página inicial
ro: Înapoi la prima pagină
ru: На главную старницу
si: නැවතත් ප්‍රධාන පිටුවට
sv: Åter till startsidan
th: กลับไปหน้าแรก
tr: Ana sayfaya dön
uk: Повернутися на головну сторінку
zh_cn: 返回首页
zh_tw: 回到首頁

source: Find
ar: ابحث
bg: Търсене
bn: খুঁজুন
ca: Cerca
cs: Vyhledat
de: Suche
el: Εύρεση
es: Buscar
eu: Bilatu
fa: یافتن
fi: Etsi
fr: Trouver
ga: Aimsigh
he: מצא
hi: खोजें
hr: Traži
it: Trova
jp: 検索
kk: Табу
ko: 찾기
nb: Finn
nl: Vind
no: Finn
pl: Znajdź
pt: Buscar
ro: Caută
ru: Поиск
si: සොයන්න
sv: Sök
th: ค้นหา
tr: Bul
uk: Пошук
zh_cn: 查找
zh_tw: 搜尋

source: Stats for %1
ar: احصائيات لـ 1%
bg: Статистики за %1
bn: %1 এর পরিসংখ্যান
ca: Estadístiques sobre %1
cs: Statistika pro %1
da: Statistik for %1
de: Statistiken für %1
el: Στατιστικά για %1
es: Estadísticas de %1
eu: %1-entzako estatistikak
fa: آمار 1 درصد
fi: %1:n tilastot
fr: Statistiques pour %1
ga: Staitisticí le %1
he: סטטיסטיקות עבור %1
hi: %1 के लिए आंकड़े
hr: Statistike za %1
it: Statistiche di %1
jp: %1の統計情報
kk: %1 үшін статистика
ko: %1에 대한 통계
nb: Statistikk for %1
nl: Statistieken voor %1
no: Statistikk for %1
pl: Statystyki dla %1
pt: Estatísticas de %1
ro: Statistici pentru %1
ru: Статистика для %1
si: %1 සඳහා සංඛ්‍යාලේඛන
sv: Statistik för %1
th: สถิติสำหรับ %1
tr: %1 için istatistikler
uk: Статистика для %1
zh_cn: 统计 %1
zh_tw: %1的統計

source: Not active in the pool, monitoring only
ar: غير مفعل في مجموعة المخدمات ,رصد فقط
bg: Неактивен в пула, само наблюдение
bn: পুলে সক্রিয় নয়, শুধুমাত্র পর্যবেক্ষন
ca: No actiu al pool, només vigilat
cs: V poolu neaktivní, pouze monitorování
da: Ikke aktiv i pool'en, kun overvågning
de: Nicht im Pool aktiv, nur Überwachung.
el: Δεν είναι ενεργό στην δεξαμενή, μόνο παρακολούθηση
es: No está activo en el grupo, sólo para monitorización.
eu: Ez dago aktibo poolean, monitorizazioa soilik
fa: غیر فعال در استخر، صرفا جهت مانیتورینگ
fi: Ei aktiivinen poolissa, vain seuranta
fr: Pas actif dans le réservoir, surveillance uniquement
ga: Neamhghníomhach sa bailiúchán, ag monatóireacht amháin
he: לא פעיל כעת ב-pool, מנוטר בלבד
hi: पूल में सक्रिय नहीं, केवल निगरानी
hr: Neaktivan u pool-u, samo monitoring
it: Non attivo nel pool, solo monitoraggio
jp: プール内でアクティブではなく、監視のみ
kk: Пулда белсенді емес, тек бақылау
ko: 풀에서 활성화되지 않고 모니터링만 함
nb: Ikke aktiv i puljen, blir kun overvåket
nl: Niet actief in de pool, wordt alleen gevolgd
no: Ikkje aktiv i puljen, blir berre overvaka.
pl: Nieaktywne w puli, tylko monitorowanie
pt: Não está ativo, apenas monitoramento
ro: Nu este activ în comunitate, doar monitorizez
ru: Не участвует в пуле. Только наблюдается.
si: සන්සදයේ ක්‍රියාත්මක නැත, සොයාබැලීම් පමණි
sv: Ej aktiv i poolen, endast uppföljning
th: ไม่ได้ใช้งานในพูล (ตรวจสอบสถานะเท่านั้น)
tr: Havuzda aktif değil, sadece izleme
uk: Не активний у пулі, лише моніторинг
zh_cn: 不存在于pool, 仅是检测
zh_tw: 該pool沒有可用的伺服器，僅進行監測

source: Zones:
ar: نطاق
bg: Зони:
bn: অঞ্চলসমূহ:
cs: Zóny:
da: Zoner:
de: Zonen:
el: Ζώνες:
es: Zonas:
eu: Eremuak:
fa: مناطق:
fi: Vyöhykkeet:
ga: Zóin:
he: איזורים:
hi: ज़ोन:
hr: Zone:
it: Zone:
jp: ゾーン:
kk: Аймақтар:
ko: 지역:
nb: Områder:
no: Soner:
pl: Strefy:
pt: Zonas:
ro: Zone:
ru: Зоны:
si: කලාප:
sv: Zoner:
th: โซน:
tr: Bölgeler:
uk: Зони:
zh_cn: 时区:
zh_tw: 區域:

source: This server is <span class="deletion">scheduled for deletion</span> on %1.
ar: هذه الخدمة <span class="deletion">scheduled for deletion</span> on %1.
bg: Този сървър е <span class="deletion">планиран за изтриване</span> на %1.
bn: এই সার্ভারটি %1 তে <span class="deletion">ডিলিট করা হবে</span>.
ca: Aquest servidor està <span class="deletion">marcat per esborrar-se</span> el %1.
cs: <span class="deletion">Odstranění</span> tohoto serveru <span class="deletion">je naplánováno</span> na %1.
da: Denne server <span class="deletion">vil blive deaktiveret</span> den %1.
de: Dieser Server ist zur <span class="deletion">Löschung</span> am %1 markiert.
el: Αυτός ο διακομιστής <span class="deletion">έχει προγραμματιστεί για διαγραφή</span> στίς %1.
es: Este servidor se <span class="deletion">borrará</span> en %1.
eu: Zerbitzari hau <span class="deletion">ezabatzeko programatuta</span> dago %1-an.
fa: این سرور برای <span class="deletion">حذف یک درصد برنامه ریزی</span> شده است.
fi: Palvelin on <span class="deletion">määritetty poistumaan</span> %1.
fr: Ce serveur est <span class="deletion">planifié pour suppression</span> le %1.
ga: Scór reatha:: %1 (ní úsáidtear ach freastalaithe le scór níos airde ná %2 sa bailiúchán)
he: שרת זה <span class="deletion">מיועד למחיקה</span> בתאריך %1.
hi: यह सर्वर %1 को <span class="deletion">हटाने के लिए निर्धारित </span> है.
hr: Ovaj server je <span class="deletion">planiran za brisanje</span> na %1.
it: Ãˆ stata pianificata l'<span class="deletion">eliminazione</span> di questo server il %1.
jp: このサーバは%1に<span class="deletion">削除予定</span>です。
kk: Бұл сервер %1 күні <span class="deletion">жоюға жоспарланған</span>.
ko: 이 서버는 %1 에 <span class="deletion">삭제될 예정</span>입니다.
nb: Denne tjeneren er <span class="deletion">planlagt slettet</span> den %1.
nl: Deze server is <span class="deletion">gemarkeerd voor verwijdering</span> op %1.
no: Denne tenaren er<span class="deletion">planlagt for sletting/span> den %1.
pl: Ten serwer jest <span class="deletion">zaplanowany do usunięcia</span> w dniu %1.
pt: Este servidor está <span class="deletion">agendado para exclusão</span> em %1.
ro: Acest server este <span class="deletion">programat pentru stergere</span> pe %1.
ru: Этот сервер был <span class="deletion">поставлен на удаление</span> %1.
sv: Denna server är <span class="deletion">planerad för borttagning</span> den %1.
th: เซิร์ฟเวอร์นี้<span class="deletion">มีกำหนดลบ</span>ในวันที่ %1
tr: Bu sunucu %1 üzerinde <span class="deletion">silinmek üzere işaretlenmiş</span>.
uk: Цей сервер <span class="deletion">запланований до видалення</span> %1.
zh_tw: 這個伺服器預計會在 %1 被移除

source: Current score: %1 (only servers with a score higher than %2 are used in the pool)
bg: Текущ резултат: %1 (само сървъри с резултат над %2 се използват в пула)
bn: বর্তমান স্কোর: %1 (যেসব সার্ভারের স্কোর %2 এর উপরে শুধুমাত্র সেগুলো পুলে ব‍্যবহার করা হয়)
ca: Puntuació actual: %1 (només servidors amb una puntuació de %2 o més s'utilitzen en el pool)
cs: Současné skóre: %1 (pouze servery se skóre vyšším než %2 jsou zahrnuty do poolu)
da: Nuværende score: %1 (kun servere med en score højere end %2 bliver brugt i pool'en)
de: Aktuelle Bewertung: %1 (Nur Server mit einer Bewertung über %2 werden in den Pool aufgenommen)
el: Τρέχουσα βαθμολογία: %1 (μόνο διακομιστές με βαθμολογία υψηλότερη από %2 χρησιμοποιούνται στην δεξαμενή)
es: Puntuación actual: %1 (sólo los servidores con una puntuación mayor que %2 se usan en el equipo)
eu: Oraingo puntuazioa: %1 (%2 baino puntuazio handiagoa duten zerbitzariak bakarrik erabiltzen dira poolean)
fa: امتیاز فعلی: 1% (فقط سرور هایی که امتیاز بالای 2 درصد را دارند، در استخر استفاده میشوند)
fi: Nykyinen pistemäärä: %1 (vain palvelimet joiden tulos on yli %2 ovat mukana poolissa)
fr: Score actuel : %1 (seuls les serveurs avec un score dépassant %2 seront utilisés dans le réservoir)
he: תוצאה נוכחית: %1 (רק שרתים עם תוצאה גבוהה מ-%2 יהיו בשימוש ב-pool)
hi: वर्तमान स्कोर: %1 (पूल में केवल %2 से अधिक स्कोर वाले सर्वर का उपयोग किया गया है)
hr: Trenutačni rezultat: %1 (samo serveri sa rezultatom večim od %2 su korišteni u pool-u)
it: Punteggio attuale: %1 (solo i server con punteggio maggiore a %2 vengono utilizzati nel pool)
jp: 現在のスコア: %1 (%2以上のサーバだけがプールに使用されます)
kk: Ағымдағы ұпай: %1 (%2 жоғары ұпайы бар серверлер ғана пулда қолданылады)
ko: 현재 점수: %1 (%2점이 넘는 서버들만 풀에 사용됩니다.)
nb: Nåværende poeng: %1 (kun tjenere med en høyere poengsum enn %2 blir brukt i puljen)
nl: Huidige score: %1 (alleen servers met een score hoger dan %2 worden gebruikt in de pool)
no: Gjeldane poengsum: %1 (berre tenarar med ein poengsum høgare enn %2 blir nytta i pulja)
pl: Bieżący wynik: %1 (tylko serwery z wynikiem wyższym niż %2 będą używane w puli)
pt: Pontuação atual: %1 (apenas servidores com uma pontuação maior do que %2 são usados neste pool)
ro: Scor curent: %1 ( doar serverele cu un scor mai mare de %2 sunt folosite în această comunitate )
ru: Текущий рейтинг: %1 (в пуле используются только сервера с рейтингом выше %2)
si: වර්තමාන ලකුණු: %1 (ලකුණු %2 ට වඩා වැඩි සර්වර් පමණක් සංසදය තුල බාවිතා වේ)
sv: Nuvarande poäng: %1 (endast servrar med en poäng på minst %2 används i poolen)
th: คะแนนปัจจุบัน: %1 (เฉพาะเซิร์ฟเวอร์ที่มีคะแนนสูงกว่า %2 เท่านั้นที่จะถูกใช้ในพูล)
tr: Şu anki puan: %1 (havuzda kullanılması için en az puan: %2 )
uk: Поточний рейтинг: %1 (лише сервери з рейтингом вище %2 використовуються в пулі)
zh_cn: 当前得分: %1 (这台服务器的得分比使用在pool中的 %2 要高)
zh_tw: 目前的分數: %1 (只有分數高於 %2 的伺服器會被放在pool裡面)

source: What do the graphs mean?
ar: ماذا تعني هذه المخططات البيانية
bg: Какво означават графиките?
bn: এই গ্রাফগুলো দিয়ে কি বোঝায়?
ca: Què volen dir els gràfics?
cs: Co tyto grafy znamenají?
da: Hvad betyder graferne?
de: Was bedeuten diese Graphen?
el: Τι σημαίνουν τα γραφήματα;
es: ¿Qué significan los gráficos?
eu: Zer esan nahi dute grafikoek?
fa: این نمودار ها چه چیزی را نشان میدهند؟
fi: Mitä graafit tarkoittavat?
fr: Que veulent dire les graphes ?
ga: Cad a chiallaíonn na graif?
he: מה משמעות הגרפים?
hi: ग्राफ का क्या मतलब है?
hr: Šta znače grafovi?
it: Cosa significano i grafici?
jp: グラフは意味することは?
kk: Графиктер не білдіреді?
ko: 그래프가 의미하는 것은?
nb: Hva betyr grafene?
nl: Wat betekenen de grafieken?
no: Kva tyder grafane?
pl: Co oznaczają wykresy?
pt: O que este gráfico significa?
ro: Ce înseamnă aceste grafice
ru: Что означают эти графики?
si: ප්‍රස්තාර වලින් කියැවෙන්නේ කුමක්ද ?
sv: Vad betyder graferna?
th: กราฟเหล่านี้หมายถึงอะไร?
tr: Grafikler ne anlama geliyor?
uk: Що означають ці графіки?
zh_cn: 这张图的意思是?
zh_tw: 圖示說明

source: CSV log
bg: CSV дневник
bn: সিএসভি লগ
ca: Diari en format CSV
de: CSV Protokoll
el: CSV αρχείο
es: Registro CSV
eu: CSV egunkaria
fa: لاگ CVS
fi: CSV-loki
fr: Journal CSV
ga: Loga CSV
he: לוג CSV
hi: सीएसवी लॉग
hr: CSV dnevnik
it: log CSV
jp: CSVログ
kk: CSV журналы
ko: CSV 로그
nb: CSV-logg
no: CSV-logg
pl: Dziennik CSV
ro: Jurnal CSV
ru: Журнал в формате CSV
si: CSV ලොගය
sv: Logg i CSV-format
th: บันทึก CSV
tr: CSV rapor
uk: Журнал CSV
zh_cn: CSV格式日志

source: News
ar: الأخبار
bg: Новини
bn: খবর
ca: Notícies
cs: Novinky
da: Nyheder
de: Neuigkeiten
el: Νέα
es: Noticias
eu: Berriak
fa: اخبار
fi: Uutiset
fr: Actualités
ga: Nuacht
he: חדשות
hi: समाचार
hr: Vijesti
it: Notizie
jp: ニュース
kk: Жаңалықтар
ko: 소식
nb: Nyheter
nl: Nieuws
no: Nyhende
pl: Wiadomości
pt: Novidades
ro: Ştiri
ru: Новости
si: පුවත්
sv: Nyheter
th: ข่าว
tr: Haberler
uk: Новини
zh_cn: 新闻
zh_tw: 新聞

source: How do I <i>use</i> pool.ntp.org?
ar: كيف I <i>أستخدم</i> pool.ntp.org?
bg: Как да <i>използвам</i> pool.ntp.org?
bn: আমি কিভাবে pool.ntp.org <i>ব‍্যবহার</i> করতে পারি?
ca: Com <i>faig servir</i> pool.ntp.org?
cs: Jak <i>použiji</i> pool.ntp.org?
da: Hvordan <i>bruger</i> jeg pool.ntp.org?
de: Wie kann man pool.ntp.org <i>benutzen</i>?
el: Πώς μπορώ να <i>χρησιμοποιήσω</i> το pool.ntp.org?
es: ¿Cómo <i>utilizo</i> pool.ntp.org?
eu: Nola <i>erabili</i> pool.ntp.org?
fa: چگونه از pool.ntp.org I <i>استفاده</i> کنم؟
fi: Kuinka <i>käytän</i> pool.ntp.org:ia?
fr: Comment puis-je <i>utiliser</i> pool.ntp.org ?
ga: Conas a <i>úsáidim</i> pool.ntp.org?"
he: איך אני <i>משתמש</i> ב-pool.ntp.org?
hi: पूल.एनटीपी.ओआरजी (pool.ntp.org) का कैसे <i>उपयोग</i> करें?
hr: Kako <i>koristiti</i> pool.ntp.org?
it: Come <i>uso</i> pool.ntp.org?
jp: pool.ntp.orgの<i>利用</i>方法は?
kk: pool.ntp.org қалай <i>пайдалануға</i> болады?
ko: 어떻게 pool.ntp.org를 <i>사용</i>하나요?
nb: Hvordan <i>bruker</i> jeg pool.ntp.org?
nl: Hoe <i>gebruik</i> ik pool.ntp.org?
no: Korleis<i>nyttar</i> eg pool.ntp.org?
pl: Jak <i>używać</i> pool.ntp.org?
pt: Como eu posso <i>usar</i> o pool.ntp.org?
ro: Cum <i>folosesc</i> pool.ntp.org?
ru: Как <i>использовать</i> pool.ntp.org?
si: pool.ntp.org <i>බාවිතා</i> කරන්නේ කෙසේද ?
sv: Hur <i>använder</i> jag pool.ntp.org?
th: ฉันจะ<i>ใช้งาน</i> pool.ntp.org ได้อย่างไร?
tr: pool.ntp.org nasıl <i>kullanılır</i>?
uk: Як <i>користуватись</i> pool.ntp.org?
zh_cn: 如何 <i>使用</i> pool.ntp.org?
zh_tw: 如何<i>使用</i> pool.ntp.org?

source: How do I <i>join</i> pool.ntp.org?
ar: كيف <i>أنضم</i> pool.ntp.org?
bg: Как да се <i>присъединя</i> към pool.ntp.org?
bn: আমি কিভাবে pool.ntp.org এ <i>যোগ</i> দিতে পারি?
ca: Com <i>m'apunto</i> a pool.ntp.org?
cs: Jak se <i>přidám</i> k pool.ntp.org?
da: Hvordan <i>tilmelder</i> jeg mig pool.ntp.org?
de: Wie kann man sich an pool.ntp.org <i>beteiligen</i>?
el: Πώς μπορώ να <i>συμμετάσχω</i> στο pool.ntp.org?
es: ¿Cómo <i>me uno</i> a pool.ntp.org?
eu: Nola <i>elkartu</i> pool.ntp.org-ekin?
fa: چگونه به pool.ntp.org <i>بپیوندم</i>؟
fi: Kuinka <i>liityn</i> pool.ntp.org:iin?
fr: Comment puis-je <i>rejoindre</i> pool.ntp.org ?
ga: Conas a <i>rachaidh mé isteach i</I> pool.ntp.org?"
he: איך אני <i>מצטרף</i> אל pool.ntp.org?
hi: पूल.एनटीपी.ओआरजी (pool.ntp.org) में कैसे <i>शामिल</i> हों?
hr: Kako se <i>pridružiti</i> pool.ntp.org?
it: Come mi <i>unisco</i> a pool.ntp.org?
jp: pool.ntp.orgへの<i>参加</i>方法は?
kk: pool.ntp.org <i>қосылуға</i> қалай болады?
ko: 어떻게 pool.ntp.org에 <i>참여</i>하나요?
nb: Hvordan <i>bli med</i> i pool.ntp.org?
nl: Hoe word ik <i>lid</i> van pool.ntp.org?
no: Korleis <i>bli med</i> i pool.ntp.org?
pl: Jak <i>dołączyć</i> do pool.ntp.org?
pt: Como eu posso me <i>juntar</i> ao pool.ntp.org?
ro: Cum mă <i>alatur</i> pool.ntp.org?
ru: Как <i>присоединиться</i> к pool.ntp.org?
si: pool.ntp.org සඳහා <i>ඇතුලත්</i> වන්නේ කෙසේද ?
sv: Hur <i>går jag med</i> i pool.ntp.org?
th: ฉันจะ<i>เข้าร่วม</i> pool.ntp.org ได้อย่างไร?
tr: pool.ntp.org'a nasıl <i>katılabilirsiniz</i>?
uk: Як <i>приєднатись</i> до pool.ntp.org?
zh_cn: 如何 <i>加入</i> pool.ntp.org?
zh_tw: 如何<i>加入</i> pool.ntp.org?

source: Information for vendors
ar: معلومات للمصنعين
bg: Информация за доставчици
bn: বিক্রেতাসমূহের জন‍্য তথ‍্য
ca: Informació per a venedors
cs: Informace pro výrobce
da: Information til producenter
de: Informationen für Hersteller
el: Πληροφορίες για πωλητές
es: Información para vendedores
eu: Hornitzaileentzako informazioa
fa: اطلاعات برای تولید کنندگان
fi: Tietoa laite- ja ohjelmistotoimittajille
fr: Informations pour les fournisseurs
ga: Faisnéis do dhíoltóirí
he: מידע עבור יצרנים
hi: विक्रेताओं के लिए जानकारी
hr: Informacije za prodavače
it: Informazioni per i venditori
jp: ベンダ向け情報
kk: Жеткізушілерге арналған ақпарат
ko: 제조사를 위한 정보
nb: Informasjon for leverandører
nl: Informatie voor leveranciers
no: Informasjon for leverandørar
pl: Informacje dla sprzedawców
pt: Informações para fabricantes
ro: Informaţii pentru furnizori
ru: Информация для поставщиков
si: සැපයුම්කරුවන් සඳහා තොරතුරු
sv: Information för tillverkare
th: ข้อมูลสำหรับผู้จำหน่าย
tr: Tedarikçiler için bilgi
uk: Інформація для виробників
zh_cn: 供应商资讯
zh_tw: 為服務提供者所準備的資訊

source: The mailing lists
ar: القائمة البريدية
bg: Пощенските списъци
bn: মেইলিং তালিকা
ca: Les llistes de correu
cs: E-mailové konference
da: Mailing listerne
de: E-Mail-Verteiler
el: Κοινότητα
es: Comunidad
eu: Posta zerrendak
fa: لیست پستی
fi: Postituslistat
fr: Les listes de diffusion
ga: Pobal
he: רשימות התפוצה
hi: मेलिंग सूची
hr: Zajednica
it: Mailing list
jp: メーリングリスト
kk: Пошта тізімдері
ko: 커뮤니티
nb: E-postlistene
nl: De e-maillijsten
no: E-postlistene
pl: Listy mailingowe
pt: As listas de discussão
ro: Lista de Discuţii
ru: Список E-mail рассылки
si: ඊමේල් ලැයිස්තු
sv: Våra distributionslistor
th: ชุมชน
tr: Posta listeleri
uk: Спільнота
zh_cn: 邮件列表
zh_tw: 郵件列表

source: Additional links
ar: روابط اضافية
bg: Допълнителни връзки
bn: অতিরিক্ত লিংকসমূহ
ca: Enllaços adicionals
cs: Doplňující odkazy
da: Yderlig links
de: Zusätzliche Links
el: Πρόσθετοι σύνδεσμοι
es: Enlaces adicionales
eu: Esteka gehigarriak
fa: پیوند های فرعی
fi: Lisää linkkejä
fr: Liens supplémentaires
ga: Naisc bhreise
he: קישורים נוספים
hi: अन्य लिंक
hr: Dodatni linkovi
it: Altri link
jp: 追加リンク
kk: Қосымша сілтемелер
ko: 기타 링크
nb: Ytterligere lenker
nl: Extra links
no: Fleire lenkjer
pl: Dodatkowe linki
pt: Links adicionais
ro: Link-uri adiţionale
ru: Дополнительные ссылки
si: අමතර ඇමිණුම්
sv: Extra länkar
th: ลิงก์เพิ่มเติม
tr: Ek bağlantılar
uk: Додаткові посилання
zh_cn: 更多信息
zh_tw: 其他連結

source: Can you translate?
ar: هل تستطيع الترجمة ؟
bg: Можете ли да преведете?
bn: আপনি কি অনুবাদ করতে পারেন?
ca: Pots traduir?
cs: Můžete překládat?
da: Kan du oversætte?
de: Können Sie übersetzen?
el: Μπορείς να μεταφράσεις?
es: ¿Puedes traducir?
eu: Itzuli dezakezu?
fa: میتوانید ترجمه کنید؟
fi: Osaatko kääntää?
fr: Pouvez-vous traduire ?
ga: An féidir leat aistriúchán?
he: האם תוכל לתרגם?
hi: क्या आप अनुवाद कर सकते हैं?
hr: Možete li prevoditi?
it: Puoi aiutarci a tradurre?
jp: 翻訳して頂けますか?
kk: Аудара аласыз ба?
ko: 번역해주실 수 있나요?
nb: Kan du oversette?
nl: Kunt u vertalen?
no: Kan du omsetje?
pl: Możesz tłumaczyć?
pt: Posso traduzir?
ro: Poţi traduce ?
si: ඔබටත් පරිවර්තනය කරන්න හැකිද ?
sv: Kan du översätta?
th: อยากช่วยแปลเว็บไซต์นี้ไหม?
tr: Çeviri yapabilir misiniz?
uk: Можете перекласти?
zh_cn: 您能帮助翻译吗?
zh_tw: 想要幫我們翻譯嗎?
