Repository: abh/ntppool
Catalog: i18n/*.po
Languages: ar, bg, bn, ca, cs, da, de, el, es, eu, fa, fi, fr, ga, he, hi, hr, it, jp, kk, ko, nb, nl, no, pl, pt, ro, ru, si, sv, th, tr, uk, zh_cn, zh_tw

source: Asia
ar: آسيا
bg: Азия
bn: এশিয়া
ca: Àsia
cs: Asie
da: Asien
de: Asien
el: Ασία
fa: آسیا
fi: Aasia
fr: Asie
ga: Áise
he: אסיה
hi: एशिया
hr: Azija
jp: アジア
kk: Азия
ko: 아시아
nl: AziÃ«
pl: Azja
pt: Ásia
ru: Азия
si: ආසියාව
sv: Asien
th: เอเชีย
tr: Asya
uk: Азія
zh_cn: 亚洲
zh_tw: 亞洲

source: irc_channel_description
ca: Hi ha un canal d'IRC %2 per administradors de servidors i usuaris a %1.
cs: Pro operátory serverů a uživatele existuje IRC kanál %2 na %1.
da: Der er en #ntppool IRC kanal for serveroperatører og brugere på irc.ntppool.org.
fi: Palvelinylläpitäjille ja käyttäjille on IRC-kanava %2 %1-verkossa.
he: ישנו ערוץ IRC בשם %2 עבור מפעילי שרתים ומשתמשים ברשת %1.
nl: Er is een %2 IRC-kanaal voor serverbeheerders en gebruikers op %1.
no: Det er ein %2 IRC-kanal for tjenaroperatørar og brukarar på %1.
pt: Existe um canal IRC #ntppool para administradores e usuários de servidor no irc.ntppool.org.
ro: Există canalul %2 de IRC pentru administratorii de servere şi utilizatori pe %1.
si: සර්වර ක්රියාකරවන්නම් සඳහා %2 IRC නාලිකාව ද, සාමාන්‍ය පරිශීලකයින් සඳහා %1 ද ක්‍රියාත්මක වේ.
tr: %1 üzerinde operatörler ve kullanıcılar için %2 IRC kanalı bulunmaktadır.

source: This server is <span class="deletion">scheduled for deletion</span> on %1.
si: මෙම සර්වරය %1 ට <span class="deletion">ඉවත්කිරිමට ලේඛනගත කොට ඇත</span>.
zh_cn: 服务器 <span class="deletion">计划删除</span> 于 %1.

source: Discourse forum
ko: 디스코스 게시판

source: This server was <span class="deletion">scheduled for deletion</span> on %1.
th: เซิร์ฟเวอร์นี้<span class="deletion">มีกำหนดลบ</span>เมื่อวันที่ %1
