[% page.title = '¿C&oacute;mo configuro el NTP en el grupo?' %]

<div class="block">
	<h3><a name="use"></a>&iquest;C&oacute;mo utilizo pool.ntp.org?</h3>

	<p>
	Si &uacute;nicamente quieres sincronizar el reloj de tus ordenadores con la hora de la red,
	el archivo de configuraci&oacute;n (para el ntpd que se distribuye en
	<a href="http://www.ntp.org">ntp.org </a> en cualquiera de los sistemas operativos
	soportados - <b>Linux, *BSD, Windows e incluso algunos otros sistemas m&aacute;s ex&oacute;ticos</b>),
	es muy sencillo:
	</p>

	[% INCLUDE "ntppool/use/sample-config.html" %]

	<p>
	Los nombres 0, 1, 2 y 3.pool.ntp.org apuntan a un conjunto de servidores seleccionados de
	forma aleatoria que cambian cada hora. Aseg&uacute;rate de que el reloj de tu ordenador
	est&eacute; configurado de forma correcta (con muy pocos minutos de diferencia con la hora 'real').
	Podr&iacute;as usar <tt>ntpdate pool.ntp.org</tt>, o simplemente la orden <tt>date</tt>
	y sincronizarlo con tu reloj de pulsera. Arranca ntpd, y en un tiempo m&aacute;s o
	menos razonable (&iexcl;Podr&iacute;a ser de hasta media hora!),
	la orden <tt>ntpq -pn</tt> deber&iacute;a mostrar algo as&iacute;:
	</p>

	[% INCLUDE "ntppool/use/sample-ntpq.html" %]

	<p>
	Las direcciones IP podr&iacute;an ser diferentes, porque se asignan servidores de hora
	de forma aleatoria. Lo m&aacute;s importante es que las l&iacute;neas que empiezan con asterisco (<tt>*</tt>),
	indican que tu ordenador obtiene la hora de Internet.
	&iexcl;Ya no te tendr&aacute;s que preocuparte por ello nunca m&aacute;s!
	</p>

	<p>
	Como <tt>pool.ntp.org</tt> asigna servidores de hora de cualquier parte del mundo,
	la calidad de la hora no ser&aacute; la ideal. Obtendr&aacute;s mejores resultados si
	usas las <a href="/zone/@">zonas continentales</a> (Por ejemplo
	<i><a href="/zone/europe">Europa</a>,
	<a href="/zone/north-america">Norteam&eacute;rica</a>,
	<a href="/zone/oceania">Ocean&iacute;a</a> o
	<a href="/zone/asia">Asia</a>.pool.ntp.org</i>),
	e incluso mejor si usas la zona de tu pa&iacute;s (por ejemplo es.pool.ntp.org en Espa&ntilde;a)
	. Para todas estas zonas, tambi&eacute;n puedes usar los prefijos 0, 1 o 2, como 0.es.pool.ntp.org.
	Observa, sin embargo, que la zona puede no existir en tu pa&iacute;s, o podr&iacute;a contener solo
	uno o dos servidores de hora. Si conoces servidores de hora cercanos
	(medido en distancia de red, con las &oacute;rdenes <tt>traceroute</tt> o <tt>ping</tt>),
	mejor a&uacute;n.
	</p>

	<p>
	Si est&aacute;s usando <b>una versi&oacute;n de Windows reciente</b>, puedes utilizar
	el cliente ntp integrado en el sistema. Para ello, ejecuta como administrador
	</p>

<pre class="code">
w32tm /config /syncfromflags:manual /manualpeerlist:"0.pool.ntp.org 1.pool.ntp.org 2.pool.ntp.org 3.pool.ntp.org"
</pre>
	<p>
	en el s&iacute;mbolo de espera de &oacute;rdenes del sistema. Esto deber&iacute;a
	funcionar en Windows 2003 y versiones posteriores. Si utilizas una versi&oacute;n anterior
	de Windows, puedes intentar
	</p>

<pre class="code">
net time /setsntp:"0.pool.ntp.org 1.pool.ntp.org 2.pool.ntp.org 3.pool.ntp.org"
</pre>

	<p>
	Puedes tambi&eacute;n conseguirlo, haciendo clic derecho en el reloj de la barra
	de tareas (como administrador) y seleccionar 'Ajustar fecha y hora' e introducir el
	nombre del servidor en la pesta&ntilde;a 'Hora de Internet'.
	</p>

	<p>
	Meinberg port&oacute; el <a href="http://www.meinberg.de/english/sw/ntp.htm">demonio ntp a Windows</a>.
	</p>

	<p>
	Si tu sistema Windows forma parte de un dominio, no puedes actualizar la hora de tu ordenador
	de forma independiente. Para m&aacute;s informaci&oacute;n acerca de c&oacute;mo ajustar la
	hora en Windows, echa un vistazo a
	<a href="http://technet.microsoft.com/es-es/library/cc757178%28WS.10%29.aspx">Introducci&oacute;n al servicio de hora de Windows</a>.
	</p>
</div>

<div class="block">
	<h3>Notas adicionales</h3>
	<p><span class="hook">Si tienes una direcci&oacute;n IP est&aacute;tica y una conexi&oacute;n a Internet razonable</span>
	(el ancho de banda no es tan importante, simplemente deber&iacute;a ser estable y no estar demasiado sobrecargado),
	por favor, considera donar tu servidor a la lista de servidores. No te costar&aacute; m&aacute;s que algunos
	cientos de bytes por segundo de tr&aacute;fico y nos ayudar&aacute;s a mantener este proyecto vivo.
	Por favor, lee <a href="/join.html">la p&aacute;gina de participaci&oacute;n</a> para obtener m&aacute;s informaci&oacute;n.
	</p>

	<p><span class="hook">Si tu proveedor de Internet tiene un servidor de hora</span>, o si conoces un
	servidor de hora fiable cercano, deber&iacute;as usarlo en lugar de los de esta lista.
	Probablemente obtendr&aacute;s una hora m&aacute;s precisa y usar&aacute;s menos recursos de red.
	Si solo conoces un servidor de hora cercano, puedes por supuesto usarlo y usar dos m&aacute;s de pool.ntp.org.
	</p>

	<p><span class="hook">Es raro, pero alguna vez puede ocurrir que se asigne dos veces el mismo servidor</span>.
	Normalmente, con solo reiniciar el servicio ntp es suficiente para soluciona el problema.
	Si usas una zona de pa&iacute;s, por favor, piensa que hay posibilidad de que solo
	haya un servidor conocido en el proyecto en el pa&iacute;s. En este caso, es mejor utilizar
	una zona continental. Puedes <a href="/zone">explorar las zonas</a> para ver cuantos
	servidores tenemos en cada una.
	</p>

	<p><span class="hook">S&eacute; ben&eacute;volo</span>. Algunos servidores est&aacute;n administrados por voluntarios,
	y en la mayor&iacute;a de las ocasiones, los servidores son realmente servidores de archivos,
	de correo o web, los cuales tambi&eacute;n ejecutan el servicio ntp.
	Por tanto, no uses m&aacute;s de tres servidores de hora en tu configuraci&oacute;n y no hagas jugarretas
	con con <tt>burst</tt> o <tt>minpoll</tt>. Todo lo que conseguir&aacute;s es una carga extra
	en los servidores de los voluntarios.
        </p>

	<p><span class="hook">Aseg&uacute;rate de que la <i>configuraci&oacute;n de zona horaria</i> de tu ordenador sea correcta</span>.
	ntpd no hace nada con las zonas horarias, solo usa la zona horaria UTC (Tiempo Universal Coordinado) internamente.
	</p>

	<p><span class="hook">Si estas sincronizando una red de ordenadores con pool.ntp.org</span>,
	por favor, configura uno de tus ordenadores como servidor de hora y configura el resto de ordenadores para que se sincronicen con &eacute;ste,
	(tendr&aacute;s que leer un poco para hacerlo, pero no es dif&iacute;cil).
	Y siempre puedes contar con el <a href="news:comp.protocols.time.ntp">grupo de noticias comp.protocols.time.ntp</a>
	</p>

	<p class="thanks">
	Llegados a este punto, quisiera dar las gracias a esas personas que donan su tiempo y servidores de hora a esta red.
	</p>
</div>
